Revit 2024 API
ParameterTypeId.StairstypeIntermediateSupportType Property
 "Middle Support Type": Intermediate Support Type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairstypeIntermediateSupportType { get; }
Visual Basic
Public Shared ReadOnly Property StairstypeIntermediateSupportType As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairstypeIntermediateSupportType {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace